In [3]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [4]:
outside = ['G1' ,'G1' , 'G1' , 'G2' ,'G2' , 'G2']

inside = [1,2,3,1,2,3]

hier_inside = list(zip(outside , inside))

hier_index = pd.MultiIndex.from_tuples(hier_inside)

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [6]:
np.random.seed(101)

newdf = pd.DataFrame(np.random.randn(6,2) , index= hier_index , columns=['A' , 'B'])

In [7]:
newdf

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [8]:
newdf.loc['G1'].loc[2]

A    0.907969
B    0.503826
Name: 2, dtype: float64

In [9]:
newdf.index.names = ['Group' , 'Num']

newdf

                  A         B
Group Num
G1    1    2.706850  0.628133
      2    0.907969  0.503826
      3    0.651118 -0.319318
G2    1   -0.848077  0.605965
      2   -2.018168  0.740122
      3    0.528813 -0.589001

In [10]:
dec2 ={'A' : [1, 2, np.nan] , 
       'B' : [5 , np.nan , np.nan] , 
       'C' : [1 , 2,3]}


df2 = pd.DataFrame(dec2)

df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df2.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
df2.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [13]:
df2.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df2.fillna(value= "Value" , inplace= True)
df2

       A      B  C
0    1.0    5.0  1
1    2.0  Value  2
2  Value  Value  3